In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns
%matplotlib inline 
#to plot the graphs inline on jupyter notebook

In [2]:
#data = pd.read_csv('train.csv')
data = pd.read_csv('test.csv')

In [3]:
data = data.set_index(data['PassengerId'])

In [4]:
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
import string
def substrings_in_string(big_string, substrings):
    for substring in substrings:
        if str.find(big_string, substring) != -1:
            return substring
    print(big_string)
    return np.nan

In [6]:
title_list=['Mrs', 'Mr', 'Master', 'Miss', 'Major', 'Rev',
                    'Dr', 'Ms', 'Mlle','Col', 'Capt', 'Mme', 'Countess',
                    'Don', 'Jonkheer']

In [7]:
data['Title']=data['Name'].map(lambda x: substrings_in_string(x, title_list))

In [8]:
#replacing all titles with mr, mrs, miss, master
def replace_titles(x):
    title=x['Title']
    if title in ['Don', 'Major', 'Capt', 'Jonkheer', 'Rev', 'Col']:
        return 'Mr'
    elif title in ['Countess', 'Mme']:
        return 'Mrs'
    elif title in ['Mlle', 'Ms']:
        return 'Miss'
    elif title =='Dr':
        if x['Sex']=='Male':
            return 'Mr'
        else:
            return 'Mrs'
    else:
        return title
data['Title']=data.apply(replace_titles, axis=1)

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
 11  Title        418 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 42.5+ KB

In [10]:
data['Age'].fillna(value = data.Age.mean(), inplace = True)

In [11]:
def replace_cabin(x):
    cabin = x['Cabin']
    if (cabin == 'NoCabin'):
        return 'NoCabin'
    else:
        return 'Cabin'

In [12]:
data.Cabin.fillna(value='NoCabin', inplace = True)

In [13]:
data['Cabin'] = data.apply(replace_cabin, axis = 1)

In [14]:
data.drop(['Name','Ticket'],axis=1, inplace = True)

In [15]:
data['Embarked'].fillna(value = "S", inplace = True)

In [16]:
data = pd.get_dummies(data,columns=["Sex","Cabin","Embarked","Title"])

In [22]:
data.drop(['PassengerId'],inplace = True,axis=1)

In [23]:
data.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Cabin_Cabin,Cabin_NoCabin,Embarked_C,Embarked_Q,Embarked_S,Title_Master,Title_Miss,Title_Mr,Title_Mrs
PassengerId,,,,,,,,,,,,,,,,
892,3,34.5,0,0,7.8292,0,1,0,1,0,1,0,0,0,1,0
893,3,47.0,1,0,7.0000,1,0,0,1,0,0,1,0,0,0,1
894,2,62.0,0,0,9.6875,0,1,0,1,0,1,0,0,0,1,0
895,3,27.0,0,0,8.6625,0,1,0,1,0,0,1,0,0,1,0
896,3,22.0,1,1,12.2875,1,0,0,1,0,0,1,0,0,0,1

In [24]:
# load the model from disk
import pickle
filename = 'finalized_model.sav'
load_model = pickle.load(open(filename, 'rb'))
result = load_model.predict(data)
print(result)

[0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 1 0 0 1 1 0 1 0 1 0 0 0 0 0 0 0 1 0 0
 0 0 1 0 1 0 1 1 0 0 0 1 0 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 0 1 1 0 0 0
 1 0 0 1 0 1 1 0 0 0 0 0 1 1 1 1 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 1 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 0 0 0 1 1 1 0 1 1 1 0 0 0 0 0 1 0 0 0 0 0 0 1 1 1 1 1 0 1 1 0 1
 0 1 0 0 0 0 0 1 0 1 0 1 0 0 0 1 1 0 1 0 0 1 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0
 1 0 1 0 0 1 0 0 0 1 0 0 1 0 0 0 1 1 1 1 0 0 0 0 1 0 1 0 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 1 1 0 0 0 0 0 0 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 1 0 0 0 1 1 0 0 0 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 1 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 0 0 1 1 1 1 0 1 0 0 1]

C:\Users\narottam\Anaconda3\lib\site-packages\xgboost\data.py:112: UserWarning: Use subset (sliced data) of np.ndarray is not recommended because it will generate extra copies and increase memory consumption
  warnings.warn(

In [26]:
sub = pd.DataFrame()
sub['PassengerId'] = data.index

In [27]:
sub['Survived'] = result

In [28]:
sub

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [29]:
sub.to_csv('submission.csv')

In [30]:
2/3

0.6666666666666666

In [34]:
print("Hello : {}".format(10))

Hello : 10